
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>3.3-平衡二叉查找树BalancedSearchTrees · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="3.2-binarysearchtrees.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Algorithms
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../2-sorting/">
            
                <a href="../2-sorting/">
            
                    
                    2-排序Sorting
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../2-sorting/2.1-elementarysorts.html">
            
                <a href="../2-sorting/2.1-elementarysorts.html">
            
                    
                    2.1-基本排序ElementarySorts
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../2-sorting/2.2-mergesort.html">
            
                <a href="../2-sorting/2.2-mergesort.html">
            
                    
                    2.2-归并排序Mergesort
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../2-sorting/2.3-quicksort.html">
            
                <a href="../2-sorting/2.3-quicksort.html">
            
                    
                    2.3-快速排序Quicksort
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="../2-sorting/2.4-priorityqueues.html">
            
                <a href="../2-sorting/2.4-priorityqueues.html">
            
                    
                    2.4-优先队列PriorityQueues
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="../2-sorting/2.5-applications.html">
            
                <a href="../2-sorting/2.5-applications.html">
            
                    
                    2.5-排序的应用applications
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../">
            
                <a href="../">
            
                    
                    3-查找Searching
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="3.1-symboltables.html">
            
                <a href="3.1-symboltables.html">
            
                    
                    3.1-符号表SymbolTables
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="3.2-binarysearchtrees.html">
            
                <a href="3.2-binarysearchtrees.html">
            
                    
                    3.2-二分查找树BinarySearchTrees
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.3" data-path="3.3-balancedsearchtrees.html">
            
                <a href="3.3-balancedsearchtrees.html">
            
                    
                    3.3-平衡二叉查找树BalancedSearchTrees
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >3.3-平衡二叉查找树BalancedSearchTrees</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="33-&#x5E73;&#x8861;&#x4E8C;&#x53C9;&#x67E5;&#x627E;&#x6811;balancedsearchtrees">3.3-&#x5E73;&#x8861;&#x4E8C;&#x53C9;&#x67E5;&#x627E;&#x6811;BalancedSearchTrees</h1>
<p>&#x4E8C;&#x53C9;&#x67E5;&#x627E;&#x6811;&#x5728;&#x6700;&#x5DEE;&#x60C5;&#x51B5;&#x4E0B;&#x4F1A;&#x9000;&#x5316;&#x6210;&#x94FE;&#x8868;&#xFF0C;&#x4E3A;&#x4E86;&#x4FDD;&#x8BC1;&#x5BF9;&#x6570;&#x7EA7;&#x7684;&#x67E5;&#x627E;&#x901F;&#x5EA6;&#xFF0C;&#x9700;&#x8981;&#x4FDD;&#x8BC1;&#x4E8C;&#x53C9;&#x6811;&#x7684;&#x5E73;&#x8861;&#xFF0C;&#x5373;&#x4FDD;&#x8BC1;&#x4E8C;&#x53C9;&#x6811;&#x4EFB;&#x610F;&#x7ED3;&#x70B9;&#x7684;&#x5DE6;&#x53F3;&#x5B50;&#x6811;&#x9AD8;&#x5EA6;&#x76F8;&#x5DEE;&#x4E0D;&#x5927;&#x4E8E;1&#x3002;</p>
<blockquote>
<p><a href="https://algs4.cs.princeton.edu/33balanced" target="_blank">&#x5E73;&#x8861;&#x4E8C;&#x53C9;&#x6811;</a>&#xFF1A;&#x4EFB;&#x610F;&#x8282;&#x70B9;&#x7684;&#x5B50;&#x6811;&#x7684;&#x9AD8;&#x5EA6;&#x5DEE;&#x90FD;&#x5C0F;&#x4E8E;&#x7B49;&#x4E8E;1&#x7684;&#x4E8C;&#x53C9;&#x6811;&#x3002;</p>
</blockquote>
<h2 id="2-3&#x67E5;&#x627E;&#x6811;">2-3&#x67E5;&#x627E;&#x6811;</h2>
<p>&#x4E00;&#x68F5;&#x4E8C;&#x53C9;&#x6811;&#x4E00;&#x822C;&#x53EA;&#x5141;&#x8BB8;&#x7ED3;&#x70B9;&#x4E2D;&#x4FDD;&#x5B58;&#x4E00;&#x4E2A;&#x952E;&#xFF0C;&#x4E00;&#x4E2A;&#x7ED3;&#x70B9;&#x6709;&#x4E24;&#x4E2A;&#x5B50;&#x7ED3;&#x70B9;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x7ED3;&#x70B9;&#x79F0;&#x4E3A;<code>2-</code>&#x7ED3;&#x70B9;&#xFF1B;&#x6211;&#x4EEC;&#x6269;&#x5C55;&#x4E00;&#x4E0B;&#xFF0C;&#x8BA9;&#x6BCF;&#x4E2A;&#x7ED3;&#x70B9;&#x53EF;&#x5B58;&#x50A8;&#x4E24;&#x4E2A;&#x952E;&#xFF0C;&#x5E76;&#x53EF;&#x4EE5;&#x6709;&#x4E09;&#x4E2A;&#x5B50;&#x7ED3;&#x70B9;&#xFF0C;&#x79F0;&#x4E3A;<code>3-</code>&#x7ED3;&#x70B9;&#x3002;&#x90A3;&#x4E48;&#x53EF;&#x4EE5;&#x6784;&#x5EFA;&#x4E00;&#x68F5;<code>2-3</code>&#x67E5;&#x627E;&#x6811;&#xFF0C;&#x7528;&#x5B83;&#x6765;&#x5B9E;&#x73B0;&#x4E8C;&#x53C9;&#x6811;&#x7684;&#x5E73;&#x8861;&#x3002;</p>
<p><img src="../.gitbook/assets/23tree-anatomy.png" alt="2-3&#x67E5;&#x627E;&#x6811;"></p>
<h3 id="&#x67E5;&#x627E;">&#x67E5;&#x627E;</h3>
<p>&#x7C7B;&#x4F3C;&#x4E8E;&#x4E8C;&#x53C9;&#x67E5;&#x627E;&#x6811;&#x7684;&#x67E5;&#x627E;&#x65B9;&#x5F0F;&#xFF0C;&#x5C06;&#x76EE;&#x6807;&#x503C;&#x4E0E;&#x7ED3;&#x70B9;&#x5BF9;&#x6BD4;&#xFF1A;</p>
<ul>
<li>&#x82E5;&#x7ED3;&#x70B9;&#x4E3A;&#x7A7A;&#xFF0C;&#x5219;&#x8FD4;&#x56DE;&#x7A7A;</li>
<li>&#x82E5;&#x7B49;&#x4E8E;&#x7ED3;&#x70B9;&#x4E2D;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x7684;&#x503C;&#xFF0C;&#x5219;&#x8FD4;&#x56DE;</li>
<li>&#x82E5;&#x6BD4;&#x7ED3;&#x70B9;&#x6240;&#x6709;&#x503C;&#x5C0F;&#xFF0C;&#x5219;&#x5411;&#x5DE6;&#x5B50;&#x6811;&#x67E5;&#x627E;</li>
<li>&#x82E5;&#x5728;&#x7ED3;&#x70B9;&#x5B58;&#x5728;&#x4E24;&#x4E2A;&#x503C;&#x4E14;&#x76EE;&#x6807;&#x503C;&#x5904;&#x4E8E;&#x4E24;&#x4E2A;&#x503C;&#x4E2D;&#x95F4;&#xFF0C;&#x5219;&#x5411;&#x4E2D;&#x5B50;&#x6811;&#x67E5;&#x627E;</li>
<li>&#x82E5;&#x6BD4;&#x7ED3;&#x70B9;&#x6240;&#x6709;&#x503C;&#x5927;&#xFF0C;&#x5219;&#x5411;&#x53F3;&#x5B50;&#x6811;&#x67E5;&#x627E;</li>
</ul>
<h3 id="&#x63D2;&#x5165;">&#x63D2;&#x5165;</h3>
<h4 id="&#x5411;2-&#x7ED3;&#x70B9;&#x4E2D;&#x63D2;&#x5165;&#x65B0;&#x952E;">&#x5411;2-&#x7ED3;&#x70B9;&#x4E2D;&#x63D2;&#x5165;&#x65B0;&#x952E;</h4>
<p>&#x5728;&#x4E8C;&#x53C9;&#x67E5;&#x627E;&#x6811;&#x4E2D;&#x63D2;&#x5165;&#x65B0;&#x952E;&#xFF0C;&#x4F1A;&#x52A0;&#x5165;&#x65B0;&#x7ED3;&#x70B9;&#xFF0C;&#x800C;&#x65E0;&#x6CD5;&#x4FDD;&#x6301;&#x5E73;&#x8861;&#x3002;&#x5728;<code>2-3</code>&#x6811;&#x4E2D;&#x63D2;&#x5165;&#x65F6;&#xFF0C;&#x82E5;&#x67E5;&#x627E;&#x5230;&#x8981;&#x63D2;&#x5165;&#x7684;&#x7ED3;&#x70B9;&#x4E3A;<code>2-</code>&#x7ED3;&#x70B9;&#x65F6;&#xFF0C;&#x76F4;&#x63A5;&#x5C06;&#x952E;&#x63D2;&#x5165;&#x5230;&#x8BE5;&#x7ED3;&#x70B9;&#x4E2D;&#xFF0C;&#x5373;&#x4FDD;&#x8BC1;&#x4E86;&#x6811;&#x7684;&#x5E73;&#x8861;&#x3002;</p>
<p><img src="../.gitbook/assets/23tree-insert2.png" alt="&#x5411;2-&#x7ED3;&#x70B9;&#x4E2D;&#x63D2;&#x5165;&#x65B0;&#x952E;"></p>
<h4 id="&#x5411;3-&#x7ED3;&#x70B9;&#x4E2D;&#x63D2;&#x5165;&#x65B0;&#x952E;">&#x5411;3-&#x7ED3;&#x70B9;&#x4E2D;&#x63D2;&#x5165;&#x65B0;&#x952E;</h4>
<p>&#x5411;3-&#x7ED3;&#x70B9;&#x4E2D;&#x63D2;&#x5165;&#x65B0;&#x952E;&#x9700;&#x8003;&#x8651;&#x4EE5;&#x4E0B;&#x51E0;&#x79CD;&#x60C5;&#x51B5;&#xFF1A;</p>
<h5 id="&#x4E00;&#x68F5;&#x53EA;&#x6709;&#x4E00;&#x4E2A;3-&#x7ED3;&#x70B9;&#x7684;&#x6811;">&#x4E00;&#x68F5;&#x53EA;&#x6709;&#x4E00;&#x4E2A;3-&#x7ED3;&#x70B9;&#x7684;&#x6811;</h5>
<p>&#x5148;&#x4ECE;&#x6700;&#x7B80;&#x5355;&#x7684;&#x60C5;&#x51B5;&#x51FA;&#x53D1;&#xFF0C;&#x82E5;&#x4E00;&#x68F5;&#x6811;&#x53EA;&#x6709;&#x4E00;&#x4E2A;<code>3-</code>&#x7ED3;&#x70B9;&#xFF1A;</p>
<ul>
<li>&#x5148;&#x5C06;&#x952E;&#x63D2;&#x5165;<code>3-</code>&#x7ED3;&#x70B9;&#xFF0C;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;<code>4-</code>&#x7ED3;&#x70B9;&#xFF0C;&#x5177;&#x6709;4&#x4E2A;&#x5B50;&#x94FE;&#x63A5;</li>
<li>&#x5C06;<code>4-</code>&#x7ED3;&#x70B9;&#x5206;&#x89E3;&#x4E3A;&#x4E00;&#x68F5;<code>2-3</code>&#x6811;&#xFF0C;&#x9996;&#x5148;&#x627E;&#x5230;&#x4E09;&#x4E2A;&#x952E;&#x7684;&#x4E2D;&#x95F4;&#x503C;</li>
<li>&#x5C06;&#x4E2D;&#x503C;&#x63D0;&#x5347;&#x4E3A;&#x7236;&#x7ED3;&#x70B9;&#xFF0C;&#x5DE6;&#x53F3;&#x5B50;&#x6811;&#x4E3A;&#x5176;&#x4ED6;&#x4E24;&#x4E2A;&#x952E;&#x503C;&#xFF0C;&#x5206;&#x522B;&#x5E26;&#x4E0A;4&#x4E2A;&#x5B50;&#x94FE;&#x63A5;&#x4E2D;&#x7684;&#x4E24;&#x4E2A;&#x5B50;&#x94FE;&#x63A5;</li>
</ul>
<p><img src="../.gitbook/assets/23tree-insert3a.png" alt="&#x53EA;&#x6709;&#x4E00;&#x4E2A;3-&#x7ED3;&#x70B9;"></p>
<h5 id="3-&#x7ED3;&#x70B9;&#x7684;&#x7236;&#x7ED3;&#x70B9;&#x4E3A;2-&#x7ED3;&#x70B9;">3-&#x7ED3;&#x70B9;&#x7684;&#x7236;&#x7ED3;&#x70B9;&#x4E3A;2-&#x7ED3;&#x70B9;</h5>
<p>&#x6B65;&#x9AA4;&#x540C;&#x4E0A;&#xFF0C;&#x4F46;&#x5728;&#x5C06;&#x4E2D;&#x503C;&#x63D0;&#x5347;&#x4E3A;&#x7236;&#x7ED3;&#x70B9;&#x540E;&#xFF0C;&#x8981;&#x628A;&#x5B83;&#x653E;&#x5165;&#x7236;&#x7ED3;&#x70B9;&#x4E2D;&#x3002;&#x6B64;&#x65F6;&#x7236;&#x7ED3;&#x70B9;&#x4E2D;&#x6709;&#x4E24;&#x4E2A;&#x952E;&#xFF0C;&#x7B26;&#x5408;&#x6811;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x4EA6;&#x4FDD;&#x6301;&#x4E86;&#x6811;&#x7684;&#x5E73;&#x8861;&#x3002;</p>
<p><img src="../.gitbook/assets/23tree-insert3b.png" alt="&#x7236;&#x7ED3;&#x70B9;&#x4E3A;2-&#x7ED3;&#x70B9;"></p>
<h5 id="3-&#x7ED3;&#x70B9;&#x7684;&#x7236;&#x7ED3;&#x70B9;&#x4E3A;3-&#x7ED3;&#x70B9;">3-&#x7ED3;&#x70B9;&#x7684;&#x7236;&#x7ED3;&#x70B9;&#x4E3A;3-&#x7ED3;&#x70B9;</h5>
<p>&#x6B65;&#x9AA4;&#x4EA6;&#x540C;&#x4E0A;&#xFF0C;&#x5C06;&#x4E2D;&#x503C;&#x63D0;&#x5347;&#x4E3A;&#x7236;&#x7ED3;&#x70B9;&#x5E76;&#x653E;&#x5165;&#x7236;&#x7ED3;&#x70B9;&#x540E;&#xFF0C;&#x6B64;&#x65F6;&#x7236;&#x7ED3;&#x70B9;&#x4E5F;&#x6709;&#x4E86;3&#x4E2A;&#x7ED3;&#x70B9;&#xFF0C;&#x9700;&#x8981;&#x5C06;&#x6B64;&#x7ED3;&#x70B9;&#x518D;&#x6B21;&#x62C6;&#x5206;&#xFF0C;&#x63D0;&#x53D6;&#x4E2D;&#x503C;&#x5411;&#x4E0A;&#x6210;&#x4E3A;&#x7236;&#x7ED3;&#x70B9;&#xFF1B;&#x5F53;&#x7236;&#x7ED3;&#x70B9;&#x4E2D;&#x5B58;&#x5728;3&#x4E2A;&#x7ED3;&#x70B9;&#xFF0C;&#x5219;&#x4E0D;&#x65AD;&#x9012;&#x5F52;&#x5411;&#x4E0A;&#x62BD;&#x53D6;&#x3002;</p>
<p><img src="../.gitbook/assets/23tree-insert3c.png" alt="&#x7236;&#x7ED3;&#x70B9;&#x4E3A;3-&#x7ED3;&#x70B9;">
<img src="../.gitbook/assets/23tree-split.png" alt="&#x6839;&#x7ED3;&#x70B9;&#x4E3A;3-&#x7ED3;&#x70B9;"></p>
<p>&#x53EF;&#x89C1;&#xFF0C;<code>2-3</code>&#x6811;&#x662F;&#x81EA;&#x5E95;&#x5411;&#x4E0A;&#x589E;&#x957F;&#x7684;&#xFF0C;&#x5E76;&#x4FDD;&#x8BC1;&#x4E86;&#x4E8C;&#x53C9;&#x6811;&#x7684;&#x5E73;&#x8861;&#x6027;&#xFF0C;&#x7279;&#x6027;&#x662F;&#xFF1A;&#x4EFB;&#x610F;&#x7A7A;&#x94FE;&#x63A5;&#x5230;&#x6839;&#x7ED3;&#x70B9;&#x7684;&#x8DEF;&#x5F84;&#x957F;&#x5EA6;&#x90FD;&#x662F;&#x76F8;&#x7B49;&#x7684;&#x3002;</p>
<h2 id="&#x7EA2;&#x9ED1;&#x4E8C;&#x53C9;&#x67E5;&#x627E;&#x6811;">&#x7EA2;&#x9ED1;&#x4E8C;&#x53C9;&#x67E5;&#x627E;&#x6811;</h2>
<p>&#x7EA2;&#x9ED1;&#x4E8C;&#x53C9;&#x67E5;&#x627E;&#x6811;&#x662F;&#x7528;&#x6807;&#x51C6;&#x7684;&#x4E8C;&#x53C9;&#x67E5;&#x627E;&#x6811;&#xFF08;&#x5B8C;&#x5168;&#x7531;<code>2-</code>&#x7ED3;&#x70B9;&#x6784;&#x6210;) &#x548C;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x4FE1;&#x606F;&#xFF08;&#x66FF;&#x6362;<code>3-</code>&#x7ED3;&#x70B9;&#xFF09;&#x6765;&#x8868;&#x793A;<code>2-3</code>&#x6811;&#x3002;&#x6211;&#x4EEC;&#x5C06;<code>2-3</code>&#x6811;&#x4E2D;&#x7684;&#x94FE;&#x63A5;&#x5206;&#x4E3A;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#xFF1A;<em>&#x7EA2;&#x94FE;&#x63A5;</em>&#x5C06;&#x4E24;&#x4E2A;<code>2-</code>&#x7ED3;&#x70B9;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#x6784;&#x6210;&#x4E00;&#x4E2A;<code>3-</code>&#x7ED3;&#x70B9;&#xFF0C;<em>&#x9ED1;&#x94FE;&#x63A5;</em>&#x5219;&#x662F;<code>2-3</code>&#x6811;&#x4E2D;&#x7684;&#x666E;&#x901A;&#x94FE;&#x63A5;&#x3002;&#x5373;&#x5C06;<code>3-</code>&#x7ED3;&#x70B9;&#x8868;&#x793A;&#x4E3A;&#x7531;&#x4E00;&#x6761;&#x5DE6;&#x659C;&#x7684;&#x7EA2;&#x8272;&#x94FE;&#x63A5;&#x76F8;&#x8FDE;&#x7684;&#x4E24;&#x4E2A;<code>2-</code>&#x7ED3;&#x70B9;&#x3002;</p>
<p><img src="../.gitbook/assets/redblack-encoding.png" alt="&#x6839;&#x7ED3;&#x70B9;&#x4E3A;3-&#x7ED3;&#x70B9;">
<img src="../.gitbook/assets/redblack-1-1.png" alt="&#x7EA2;&#x9ED1;&#x6811;&#x548C;2-3&#x6811;"></p>
<p>&#x7EA2;&#x9ED1;&#x6811;&#x7684;&#x53E6;&#x4E00;&#x79CD;&#x5B9A;&#x4E49;&#x662F;&#x542B;&#x6709;&#x7EA2;&#x9ED1;&#x94FE;&#x63A5;&#x5E76;&#x6EE1;&#x8DB3;&#x4E0B;&#x5217;&#x6761;&#x4EF6;&#x7684;&#x4E8C;&#x53C9;&#x67E5;&#x627E;&#x6811;&#xFF1A;</p>
<ul>
<li>&#x7EA2;&#x94FE;&#x63A5;&#x5747;&#x4E3A;&#x5DE6;&#x94FE;&#x63A5;&#xFF1B;</li>
<li>&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x7ED3;&#x70B9;&#x540C;&#x65F6;&#x548C;&#x4E24;&#x6761;&#x7EA2;&#x94FE;&#x63A5;&#x76F8;&#x8FDE;&#xFF1B;</li>
<li>&#x8BE5;&#x6811;&#x662F;&#x5B8C;&#x7F8E;&#x9ED1;&#x8272;&#x5E73;&#x8861;&#x7684;&#xFF0C;&#x5373;&#x4EFB;&#x610F;&#x7A7A;&#x94FE;&#x63A5;&#x5230;&#x6839;&#x7ED3;&#x70B9;&#x7684;&#x8DEF;&#x5F84;&#x4E0A;&#x7684;&#x9ED1;&#x94FE;&#x63A5;&#x6570;&#x91CF;&#x76F8;&#x540C;&#x3002;</li>
</ul>
<p>&#x4E00;&#x4E2A;&#x7ED3;&#x70B9;&#x7684;&#x989C;&#x8272;&#x53EF;&#x901A;&#x8FC7;<code>boolean</code>&#x503C;&#x6765;&#x8868;&#x793A;&#xFF0C;<code>true</code>&#x4E3A;&#x7EA2;&#x8272;&#x3002;&#x4E00;&#x4E2A;&#x7ED3;&#x70B9;&#x7684;&#x5DE6;&#x94FE;&#x63A5;&#x4E3A;&#x7EA2;&#x8272;&#xFF0C;&#x5219;&#x53EF;&#x5C06;&#x5176;&#x5DE6;&#x7ED3;&#x70B9;&#x8868;&#x793A;&#x4E3A;&#x7EA2;&#x8272;&#xFF0C;&#x4E8E;&#x662F;&#xFF0C;&#x94FE;&#x63A5;&#x7684;&#x989C;&#x8272;&#x5728;&#x7ED3;&#x70B9;&#x4E2D;&#x5F97;&#x5230;&#x4E86;&#x4F53;&#x73B0;&#xFF0C;&#x90A3;&#x4E48;&#x7EA2;&#x9ED1;&#x6811;&#x5373;&#x662F;&#x5305;&#x62EC;&#x4E86;&#x7EA2;&#x9ED1;&#x4E24;&#x79CD;&#x989C;&#x8272;&#x7ED3;&#x70B9;&#x7684;&#x6811;&#xFF0C;&#x9ED8;&#x8BA4;&#x6700;&#x7EC8;&#x7684;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x4E3A;&#x7A7A;&#x7ED3;&#x70B9;&#xFF0C;&#x662F;&#x9ED1;&#x8272;&#x3002;</p>
<h3 id="&#x7EA2;&#x9ED1;&#x6811;&#x7684;&#x65CB;&#x8F6C;">&#x7EA2;&#x9ED1;&#x6811;&#x7684;&#x65CB;&#x8F6C;</h3>
<p>&#x5728;&#x5BF9;&#x4E8C;&#x53C9;&#x6811;&#x8FDB;&#x884C;&#x67D0;&#x4E9B;&#x64CD;&#x4F5C;&#x540E;&#xFF08;&#x5982;&#x63D2;&#x5165;&#x7ED3;&#x70B9;&#x65F6;&#xFF0C;&#x4F7F;&#x7528;&#x7EA2;&#x8272;&#x94FE;&#x63A5;&#xFF09;&#xFF0C;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x7EA2;&#x8272;&#x53F3;&#x94FE;&#x63A5;&#x6216;&#x8005;&#x4E24;&#x6761;&#x8FDE;&#x7EED;&#x7684;&#x7EA2;&#x94FE;&#x63A5;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x65CB;&#x8F6C;&#x5E76;&#x4FEE;&#x590D;&#x3002;&#x65CB;&#x8F6C;&#x4FDD;&#x6301;&#x4E86;&#x7EA2;&#x9ED1;&#x6811;&#x7684;&#x6709;&#x5E8F;&#x6027;&#x548C;&#x5B8C;&#x7F8E;&#x5E73;&#x8861;&#x3002;</p>
<h4 id="&#x5DE6;&#x65CB;">&#x5DE6;&#x65CB;</h4>
<p>&#x5C06;&#x4E00;&#x4E2A;&#x7ED3;&#x70B9;&#x7684;&#x53F3;&#x5B50;&#x6811;&#x5411;&#x5DE6;&#x65CB;&#x8F6C;&#xFF1A;&#x5C06;&#x6839;&#x7ED3;&#x70B9;&#x548C;&#x53F3;&#x5B50;&#x6811;&#x7684;&#x6839;&#x7ED3;&#x70B9;&#x5411;&#x5DE6;&#x65CB;&#x8F6C;&#xFF0C;&#x5373;&#x5C06;&#x53F3;&#x5B50;&#x6811;&#x7684;&#x6839;&#x7ED3;&#x70B9;&#x65CB;&#x8F6C;&#x81F3;&#x6839;&#x7ED3;&#x70B9;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x5176;&#x989C;&#x8272;&#x53D8;&#x4E3A;&#x539F;&#x6839;&#x7ED3;&#x70B9;&#x7684;&#x989C;&#x8272;&#xFF0C;&#x800C;&#x6839;&#x7ED3;&#x70B9;&#x4F5C;&#x4E3A;&#x6B64;&#x7ED3;&#x70B9;&#x7684;&#x5DE6;&#x5B50;&#x7ED3;&#x70B9;&#xFF0C;&#x5176;&#x989C;&#x8272;&#x53D8;&#x4E3A;&#x539F;&#x53F3;&#x5B50;&#x6811;&#x6839;&#x7ED3;&#x70B9;&#x7684;&#x989C;&#x8272;&#xFF1B;&#x90A3;&#x4E48;&#x539F;&#x6765;&#x5DE6;&#x5B50;&#x6811;&#x7684;&#x5DE6;&#x5B50;&#x6811;&#x5462;&#xFF0C;&#x53EF;&#x89C1;&#x5176;&#x503C;&#x5927;&#x4E8E;&#x539F;&#x6765;&#x7684;&#x6839;&#x7ED3;&#x70B9;&#xFF0C;&#x6240;&#x4EE5;&#x5C06;&#x5176;&#x4F5C;&#x4E3A;&#x539F;&#x6765;&#x6839;&#x7ED3;&#x70B9;&#x7684;&#x53F3;&#x5B50;&#x6811;&#x3002;</p>
<pre><code>private Node rotateLeft(Node h) {
    // assert (h != null) &amp;&amp; isRed(h.right);
    Node x = h.right;
    h.right = x.left;
    x.left = h;
    x.color = x.left.color;
    x.left.color = RED;
    x.size = h.size;
    h.size = size(h.left) + size(h.right) + 1;
    return x;
}
</code></pre><p><img src="../.gitbook/assets/redblack-left-rotate.png" alt="&#x5DE6;&#x65CB;"></p>
<h4 id="&#x53F3;&#x65CB;">&#x53F3;&#x65CB;</h4>
<p>&#x540C;&#x7406;&#xFF0C;&#x53F3;&#x65CB;&#x662F;&#x5C06;&#x5DE6;&#x5B50;&#x6811;&#x4F5C;&#x4E3A;&#x6839;&#x7ED3;&#x70B9;&#xFF0C;&#x6839;&#x7ED3;&#x70B9;&#x4F5C;&#x4E3A;&#x5176;&#x53F3;&#x5B50;&#x7ED3;&#x70B9;&#xFF0C;&#x800C;&#x539F;&#x6765;&#x7684;&#x5DE6;&#x5B50;&#x6811;&#x7684;&#x53F3;&#x5B50;&#x6811;&#x4F5C;&#x4E3A;&#x539F;&#x6765;&#x6839;&#x7ED3;&#x70B9;&#x7684;&#x5DE6;&#x5B50;&#x6811;&#x3002;</p>
<pre><code>private Node rotateRight(Node h) {
    // assert (h != null) &amp;&amp; isRed(h.left);
    Node x = h.left;
    h.left = x.right;
    x.right = h;
    x.color = x.right.color;
    x.right.color = RED;
    x.size = h.size;
    h.size = size(h.left) + size(h.right) + 1;
    return x;
}
</code></pre><p><img src="../.gitbook/assets/redblack-right-rotate.png" alt="&#x53F3;&#x65CB;"></p>
<h3 id="&#x7EA2;&#x9ED1;&#x6811;&#x63D2;&#x5165;">&#x7EA2;&#x9ED1;&#x6811;&#x63D2;&#x5165;</h3>
<h4 id="&#x5411;2-&#x7ED3;&#x70B9;&#xFF08;&#x9ED1;&#x8272;&#x7ED3;&#x70B9;&#xFF09;&#x63D2;&#x5165;&#x65B0;&#x952E;">&#x5411;2-&#x7ED3;&#x70B9;&#xFF08;&#x9ED1;&#x8272;&#x7ED3;&#x70B9;&#xFF09;&#x63D2;&#x5165;&#x65B0;&#x952E;</h4>
<p>&#x63D2;&#x5165;&#x952E;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x7EA2;&#x8272;&#x94FE;&#x63A5;&#x5C06;&#x5B83;&#x4E0E;&#x7236;&#x7ED3;&#x70B9;&#x8FDE;&#x63A5;&#x3002;&#x5411;<code>2-</code>&#x7ED3;&#x70B9;&#x63D2;&#x5165;&#x65B0;&#x952E;&#xFF0C;&#x5219;&#x4F1A;&#x5728;&#x7ED3;&#x70B9;&#x4E0B;&#x589E;&#x52A0;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x7ED3;&#x70B9;&#xFF0C;&#x82E5;&#x952E;&#x503C;&#x5C0F;&#x4E8E;&#x7ED3;&#x70B9;&#x7684;&#x503C;&#xFF0C;&#x5219;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x5DE6;&#x503E;&#x7684;&#x7EA2;&#x8272;&#x94FE;&#x63A5;&#xFF0C;&#x5219;&#x5B8C;&#x6210;&#x63D2;&#x5165;&#xFF1B;&#x82E5;&#x952E;&#x503C;&#x5927;&#x4E8E;&#x7ED3;&#x70B9;&#xFF0C;&#x5219;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x53F3;&#x503E;&#x7684;&#x7EA2;&#x8272;&#x94FE;&#x63A5;&#xFF0C;&#x662F;&#x8FDD;&#x80CC;&#x5B9A;&#x4E49;&#x7684;&#xFF0C;&#x6B64;&#x65F6;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x4E00;&#x6B21;&#x5DE6;&#x65CB;&#x3002;</p>
<h4 id="&#x5411;3-&#x7ED3;&#x70B9;&#xFF08;&#x5DE6;&#x7ED3;&#x70B9;&#x4E3A;&#x7EA2;&#x8272;&#xFF09;&#x4E2D;&#x63D2;&#x5165;&#x65B0;&#x952E;">&#x5411;3-&#x7ED3;&#x70B9;&#xFF08;&#x5DE6;&#x7ED3;&#x70B9;&#x4E3A;&#x7EA2;&#x8272;&#xFF09;&#x4E2D;&#x63D2;&#x5165;&#x65B0;&#x952E;</h4>
<p>&#x6B64;&#x65F6;&#x4F1A;&#x4F7F;&#x4E00;&#x4E2A;&#x7ED3;&#x70B9;&#x4E0A;&#x8FDE;&#x63A5;&#x4E86;&#x4E24;&#x4E2A;&#x7EA2;&#x8272;&#x94FE;&#x63A5;&#xFF0C;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x65CB;&#x8F6C;&#x6765;&#x89E3;&#x51B3;&#xFF0C;&#x5206;&#x4E09;&#x79CD;&#x60C5;&#x51B5;</p>
<h5 id="&#x65B0;&#x952E;&#x503C;&#x6700;&#x5927;">&#x65B0;&#x952E;&#x503C;&#x6700;&#x5927;</h5>
<p>&#x6B64;&#x65F6;&#x5C06;&#x65B0;&#x952E;&#x63D2;&#x5165;&#x4E3A;&#x53F3;&#x7ED3;&#x70B9;&#xFF0C;&#x6839;&#x7ED3;&#x70B9;&#x8FDE;&#x63A5;&#x4E24;&#x6761;&#x7EA2;&#x8272;&#x94FE;&#x63A5;&#xFF0C;&#x4F46;&#x6811;&#x662F;&#x5E73;&#x8861;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x6240;&#x9700;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x5C06;&#x8FD9;&#x4E24;&#x4E2A;&#x94FE;&#x63A5;&#x90FD;&#x53D8;&#x6210;&#x9ED1;&#x8272;&#x7684;&#x5373;&#x53EF;&#x3002;</p>
<h5 id="&#x65B0;&#x952E;&#x503C;&#x6700;&#x5C0F;">&#x65B0;&#x952E;&#x503C;&#x6700;&#x5C0F;</h5>
<p>&#x6B64;&#x65F6;&#x5C06;&#x65B0;&#x952E;&#x63D2;&#x5165;&#x4E3A;&#x5DE6;&#x7ED3;&#x70B9;&#x7684;&#x5DE6;&#x7ED3;&#x70B9;&#xFF0C;&#x539F;&#x6765;&#x5DE6;&#x7ED3;&#x70B9;&#x7684;&#x4E0A;&#x4E0B;&#x8FDE;&#x63A5;&#x4E24;&#x6761;&#x7EA2;&#x8272;&#x94FE;&#x63A5;&#xFF0C;&#x6B64;&#x65F6;&#x5C06;&#x4E0A;&#x5C42;&#x7684;&#x7EA2;&#x94FE;&#x63A5;&#x53F3;&#x65CB;&#x4E00;&#x6B21;&#x5373;&#x53EF;&#x5F97;&#x5230;&#x7B2C;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#xFF08;&#x5DE6;&#x53F3;&#x4E24;&#x6761;&#x7EA2;&#x8272;&#x94FE;&#x63A5;&#xFF09;&#xFF0C;&#x5C06;&#x94FE;&#x63A5;&#x53D8;&#x9ED1;&#x5373;&#x53EF;&#x3002;</p>
<h5 id="&#x65B0;&#x952E;&#x5904;&#x7406;&#x4E2D;&#x95F4;&#x503C;">&#x65B0;&#x952E;&#x5904;&#x7406;&#x4E2D;&#x95F4;&#x503C;</h5>
<p>&#x6B64;&#x65F6;&#x65B0;&#x952E;&#x5C06;&#x6210;&#x4E3A;&#x5DE6;&#x7ED3;&#x70B9;&#x7684;&#x53F3;&#x7ED3;&#x70B9;&#xFF0C;&#x539F;&#x6765;&#x5DE6;&#x7ED3;&#x70B9;&#x4E0A;&#x5C42;&#x8FDE;&#x63A5;&#x4E00;&#x6761;&#x5DE6;&#x503E;&#x7684;&#x7EA2;&#x8272;&#x94FE;&#x63A5;&#xFF0C;&#x4E0B;&#x5C42;&#x8FDE;&#x63A5;&#x4E00;&#x6761;&#x53F3;&#x503E;&#x7684;&#x7EA2;&#x8272;&#x94FE;&#x63A5;&#x3002;&#x6B64;&#x65F6;&#x5148;&#x5C06;&#x4E0B;&#x5C42;&#x8FDB;&#x884C;&#x4E00;&#x6B21;&#x5DE6;&#x65CB;&#x5373;&#x5F97;&#x5230;&#x7B2C;&#x4E8C;&#x79CD;&#x60C5;&#x51B5;&#xFF08;&#x4E0A;&#x4E0B;&#x4E24;&#x5C42;&#x5DE6;&#x503E;&#x7684;&#x7EA2;&#x8272;&#x94FE;&#x63A5;&#xFF09;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x540C;&#x4E0A;&#xFF0C;&#x4E0A;&#x5C42;&#x53F3;&#x65CB;&#xFF0C;&#x518D;&#x53D8;&#x8272;&#x5373;&#x53EF;&#x3002;</p>
<p>&#x5728;&#x4E0A;&#x8FF0;&#x4E09;&#x79CD;&#x64CD;&#x4F5C;&#x4E4B;&#x540E;&#xFF0C;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x4E24;&#x6761;&#x7EA2;&#x8272;&#x94FE;&#x63A5;&#x53D8;&#x9ED1;&#x4E4B;&#x540E;&#xFF0C;&#x9700;&#x8981;&#x540C;&#x65F6;&#x628A;&#x6839;&#x7ED3;&#x70B9;&#x53D8;&#x4E3A;&#x7EA2;&#x8272;&#xFF0C;&#x6B64;&#x540E;&#x9700;&#x8981;&#x9012;&#x5F52;&#x5224;&#x65AD;&#x4E0A;&#x5C42;&#x662F;&#x5426;&#x5B58;&#x5728;&#x4E24;&#x6761;&#x7EA2;&#x8272;&#x94FE;&#x63A5;&#xFF0C;&#x4E0D;&#x65AD;&#x91CD;&#x590D;&#x65CB;&#x8F6C;&#x64CD;&#x4F5C;&#xFF0C;&#x53EA;&#x5230;&#x6EE1;&#x8DB3;&#x7EA2;&#x9ED1;&#x6811;&#x7684;&#x5B9A;&#x4E49;&#x3002;&#x53C8;&#x77E5;&#xFF0C;&#x6574;&#x68F5;&#x6811;&#x7684;&#x6839;&#x7ED3;&#x70B9;&#x59CB;&#x7EC8;&#x4E3A;&#x9ED1;&#x8272;&#xFF0C;&#x56E0;&#x6B64;&#x6700;&#x7EC8;&#x8981;&#x5C06;&#x6574;&#x68F5;&#x6811;&#x7684;&#x6839;&#x7ED3;&#x70B9;&#x8BBE;&#x4E3A;&#x9ED1;&#x8272;&#x3002;</p>
<p>&#x53D8;&#x8272;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>private void flipColors(Node h) {
    // h must have opposite color of its two children
    // assert (h != null) &amp;&amp; (h.left != null) &amp;&amp; (h.right != null);
    // assert (!isRed(h) &amp;&amp;  isRed(h.left) &amp;&amp;  isRed(h.right))
    //    || (isRed(h)  &amp;&amp; !isRed(h.left) &amp;&amp; !isRed(h.right));
    h.color = !h.color;
    h.left.color = !h.left.color;
    h.right.color = !h.right.color;
}
</code></pre><p><img src="../.gitbook/assets/color-flip.png" alt="&#x53D8;&#x8272;"></p>
<p>&#x5728;&#x4E0A;&#x8FF0;&#x7684;&#x64CD;&#x4F5C;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5BF9;&#x7EA2;&#x9ED1;&#x6811;&#x7684;&#x64CD;&#x4F5C;&#x548C;&#x5BF9;<code>2-3</code>&#x6811;&#x7684;&#x64CD;&#x4F5C;&#x662F;&#x76F8;&#x540C;&#x7684;&#xFF0C;&#x65CB;&#x8F6C;&#x64CD;&#x4F5C;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x628A;&#x4E2D;&#x95F4;&#x503C;&#x4F5C;&#x4E3A;&#x7236;&#x7ED3;&#x70B9;&#xFF0C;&#x5E76;&#x628A;&#x5B83;&#x653E;&#x5165;&#x4E0A;&#x5C42;&#x7236;&#x7ED3;&#x70B9;&#x4E2D;&#xFF0C;&#x82E5;&#x4E0A;&#x5C42;&#x4E3A;<code>3-</code>&#x7ED3;&#x70B9;&#xFF0C;&#x5219;&#x5C42;&#x5C42;&#x9012;&#x5F52;&#x5411;&#x4E0A;&#x4F20;&#x9012;&#xFF08;&#x7EA2;&#x9ED1;&#x6811;&#x4E2D;&#x8868;&#x73B0;&#x4E3A;&#x7EA2;&#x8272;&#x94FE;&#x63A5;&#x7684;&#x5C42;&#x5C42;&#x5411;&#x4E0A;&#x4F20;&#x9012;&#xFF09;&#x3002;</p>
<p>&#x7EFC;&#x4E0A;&#xFF0C;&#x7EA2;&#x9ED1;&#x6811;&#x7684;&#x63D2;&#x5165;&#x64CD;&#x4F5C;&#x5206;&#x4E3A;&#x4EE5;&#x4E0B;&#x51E0;&#x79CD;&#xFF1A;</p>
<ul>
<li>&#x5982;&#x679C;&#x53F3;&#x5B50;&#x7ED3;&#x70B9;&#x662F;&#x7EA2;&#x8272;&#x7684;&#x800C;&#x5DE6;&#x5B50;&#x7ED3;&#x70B9;&#x662F;&#x9ED1;&#x8272;&#x7684;&#xFF0C;&#x8FDB;&#x884C;&#x5DE6;&#x65CB;&#x8F6C;&#xFF1B;</li>
<li>&#x5982;&#x679C;&#x5DE6;&#x5B50;&#x7ED3;&#x70B9;&#x662F;&#x7EA2;&#x8272;&#x7684;&#x4E14;&#x5B83;&#x7684;&#x5DE6;&#x5B50;&#x7ED3;&#x70B9;&#x4E5F;&#x662F;&#x7EA2;&#x8272;&#x7684;&#xFF0C;&#x8FDB;&#x884C;&#x53F3;&#x65CB;&#x8F6C;</li>
<li>&#x5982;&#x679C;&#x5DE6;&#x53F3;&#x5B50;&#x7ED3;&#x70B9;&#x5747;&#x4E3A;&#x7EA2;&#x8272;&#xFF0C;&#x8FDB;&#x884C;&#x989C;&#x8272;&#x8F6C;&#x6362;&#x3002;</li>
</ul>
<p>&#x63D2;&#x5165;&#x65B9;&#x6CD5;&#x7684;&#x5B9E;&#x73B0;&#xFF1A;</p>
<pre><code>public void put(Key key, Value val) { 
    // Search for key. Update value if found; grow table if new.
    root = put(root, key, val);
    root.color = BLACK;
}

private Node put(Node h, Key key, Value val) {
    if (h == null) {
        // Do standard insert, with red link to parent.
        return new Node(key, val, 1, RED);
    }
    int cmp = key.compareTo(h.key);
    if (cmp &lt; 0) {
        h.left = put(h.left, key, val);
    } else if (cmp &gt; 0) {
        h.right = put(h.right, key, val);
    } else {
        h.val = val;
    }
    if (isRed(h.right) &amp;&amp; !isRed(h.left)) {
        h = rotateLeft(h);
    }
    if (isRed(h.left) &amp;&amp; isRed(h.left.left)) {
        h = rotateRight(h);
    }
    if (isRed(h.left) &amp;&amp; isRed(h.right)) {
        flipColors(h);
    }
    h.N = size(h.left) + size(h.right) + 1;
    return h;
}
</code></pre><h3 id="&#x7EA2;&#x9ED1;&#x6811;&#x7684;&#x5220;&#x9664;">&#x7EA2;&#x9ED1;&#x6811;&#x7684;&#x5220;&#x9664;</h3>
<p>&#x4E3A;&#x4E86;&#x4FDD;&#x6301;&#x6811;&#x7684;&#x5E73;&#x8861;&#xFF0C;&#x5220;&#x9664;&#x4E00;&#x4E2A;&#x7ED3;&#x70B9;&#x540E;&#x8FD8;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x64CD;&#x4F5C;&#x6765;&#x5B9E;&#x73B0;&#x3002;&#x5148;&#x6765;&#x8003;&#x8651;&#x51E0;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;</p>
<h4 id="2-3-4&#x6811;&#x7684;&#x63D2;&#x5165;">2-3-4&#x6811;&#x7684;&#x63D2;&#x5165;</h4>
<p>&#x4E3A;&#x4E86;&#x5411;<code>2-3-4</code>&#x6811;&#x63D2;&#x5165;&#x952E;&#xFF0C;&#x7C7B;&#x4F3C;&#x7684;&#xFF0C;&#x9700;&#x8981;&#x81EA;&#x9876;&#x5411;&#x4E0B;&#x5206;&#x89E3;<code>4-</code>&#x7ED3;&#x70B9;&#xFF0C;&#x624D;&#x53EF;&#x4EE5;&#x63D2;&#x5165;&#x65B0;&#x952E;&#xFF1A;</p>
<ol>
<li>&#x5C06;<code>4-</code>&#x7ED3;&#x70B9;&#x8868;&#x793A;&#x4E3A;&#x7531;3&#x4E2A;<code>2-</code>&#x7ED3;&#x70B9;&#x7EC4;&#x6210;&#x7684;&#x4E00;&#x68F5;&#x5B50;&#x6811;&#xFF0C;&#x4E09;&#x4E2A;&#x7ED3;&#x70B9;&#x90FD;&#x7528;&#x7EA2;&#x8272;&#x94FE;&#x63A5;&#x76F8;&#x8FDE;</li>
<li>&#x5411;&#x4E0B;&#x5206;&#x89E3;&#x6240;&#x6709;<code>4-</code>&#x7ED3;&#x70B9;&#x5E76;&#x8FDB;&#x884C;&#x989C;&#x8272;&#x8F6C;&#x6362;</li>
<li>&#x5728;&#x5411;&#x4E0A;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x7528;&#x65CB;&#x8F6C;&#x5C06;<code>4-</code>&#x7ED3;&#x70B9;&#x914D;&#x5E73;</li>
</ol>
<p>&#x53EA;&#x7528;&#x5C06;<code>put</code>&#x65B9;&#x6CD5;&#x4E2D;&#x6700;&#x540E;&#x7684;<code>if</code>&#x79FB;&#x52A8;&#x5230;<code>null</code>&#x548C;&#x6BD4;&#x8F83;&#x4E4B;&#x95F4;&#xFF1A;</p>
<pre><code>public void insert(Key key, Value val) { 
    // Search for key. Update value if found; grow table if new.
    root = put(root, key, val);
    root.color = BLACK;
}

private Node insert(Node h, Key key, Value val) {
    if (h == null) {
        // Do standard insert, with red link to parent.
        return new Node(key, val, 1, RED);
    }
    if (isRed(h.left) &amp;&amp; isRed(h.right)) {
        flipColors(h);
    }
    int cmp = key.compareTo(h.key);
    if (cmp &lt; 0) {
        h.left = put(h.left, key, val);
    } else if (cmp &gt; 0) {
        h.right = put(h.right, key, val);
    } else {
        h.val = val;
    }
    if (isRed(h.right) &amp;&amp; !isRed(h.left)) {
        h = rotateLeft(h);
    }
    if (isRed(h.left) &amp;&amp; isRed(h.left.left)) {
        h = rotateRight(h);
    }
    h.N = size(h.left) + size(h.right) + 1;
    return h;
}
</code></pre><h4 id="&#x5220;&#x9664;&#x6700;&#x5C0F;&#x952E;">&#x5220;&#x9664;&#x6700;&#x5C0F;&#x952E;</h4>
<p>&#x76F4;&#x63A5;&#x5220;&#x9664;<code>2-</code>&#x7ED3;&#x70B9;&#x540E;&#xFF0C;&#x4F1A;&#x7559;&#x4E0B;&#x4E00;&#x4E2A;&#x7A7A;&#x7ED3;&#x70B9;&#xFF0C;&#x5BFC;&#x81F4;&#x6811;&#x7684;&#x4E0D;&#x5E73;&#x8861;&#xFF0C;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x5148;&#x53D8;&#x6362;&#x4F7F;&#x6811;&#x7684;&#x7ED3;&#x70B9;&#x4E3A;<code>3-</code>&#x6216;&#x4E34;&#x65F6;&#x7684;<code>4-</code>&#x7ED3;&#x70B9;&#xFF1A;</p>
<ul>
<li>&#x82E5;&#x5F53;&#x524D;&#x7ED3;&#x70B9;&#x7684;&#x5DE6;&#x5B50;&#x7ED3;&#x70B9;&#x4E0D;&#x662F;<code>2-</code>&#x7ED3;&#x70B9;&#xFF0C;&#x5B8C;&#x6210;</li>
<li>&#x82E5;&#x6839;&#x662F;<code>2-</code>&#x7ED3;&#x70B9;&#x4E14;&#x5B83;&#x7684;&#x4E24;&#x4E2A;&#x5B50;&#x7ED3;&#x70B9;&#x90FD;&#x662F;<code>2-</code>&#x7ED3;&#x70B9;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5C06;&#x8FD9;&#x4E09;&#x4E2A;&#x7ED3;&#x70B9;&#x53D8;&#x6210;&#x4E00;&#x4E2A;<code>4-</code>&#x7ED3;&#x70B9;</li>
<li>&#x82E5;&#x5F53;&#x524D;&#x7ED3;&#x70B9;&#x7684;&#x5DE6;&#x5B50;&#x7ED3;&#x70B9;&#x662F;<code>2-</code>&#x7ED3;&#x70B9;&#x800C;&#x5B83;&#x7684;&#x4EB2;&#x5144;&#x5F1F;&#x7ED3;&#x70B9;&#x4E0D;&#x662F;<code>2-</code>&#x7ED3;&#x70B9;&#xFF0C;&#x5C06;&#x5DE6;&#x5B50;&#x7ED3;&#x70B9;&#x7684;&#x5144;&#x5F1F;&#x7ED3;&#x70B9;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x952E;&#x79FB;&#x52A8;&#x5230;&#x5DE6;&#x5B50;&#x7ED3;&#x70B9;&#x4E2D;</li>
<li>&#x5982;&#x679C;&#x5F53;&#x524D;&#x7ED3;&#x70B9;&#x7684;&#x5DE6;&#x5B50;&#x7ED3;&#x70B9;&#x548C;&#x5B83;&#x7684;&#x5144;&#x5F1F;&#x7ED3;&#x70B9;&#x90FD;&#x662F;<code>2-</code>&#x7ED3;&#x70B9;&#xFF0C;&#x5C06;&#x5DE6;&#x5B50;&#x7ED3;&#x70B9;&#x3001;&#x7236;&#x7ED3;&#x70B9;&#x4E2D;&#x7684;&#x6700;&#x5C0F;&#x952E;&#x548C;&#x5DE6;&#x5B50;&#x7ED3;&#x70B9;&#x6700;&#x8FD1;&#x7684;&#x5144;&#x5F1F;&#x7ED3;&#x70B9;&#x5408;&#x5E76;&#x4E3A;&#x4E00;&#x4E2A;<code>4-</code>&#x7ED3;&#x70B9;&#xFF0C;&#x4F7F;&#x7236;&#x7ED3;&#x70B9;&#x7531;<code>3-</code>&#x7ED3;&#x70B9;&#x53D8;&#x4E3A;<code>2-</code>&#x7ED3;&#x70B9;&#x6216;&#x8005;&#x7531;<code>4-</code>&#x7ED3;&#x70B9;&#x53D8;&#x4E3A;<code>3-</code>&#x7ED3;&#x70B9;</li>
</ul>
<p>&#x6700;&#x540E;&#x80FD;&#x591F;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x542B;&#x6709;&#x6700;&#x5C0F;&#x952E;&#x7684;<code>3-</code>&#x7ED3;&#x70B9;&#x6216;&#x8005;<code>4-</code>&#x7ED3;&#x70B9;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x4ECE;&#x4E2D;&#x5C06;&#x5176;&#x5220;&#x9664;&#xFF0C;&#x5C06;<code>3-</code>&#x7ED3;&#x70B9;&#x53D8;&#x4E3A;<code>2-</code>&#x7ED3;&#x70B9;&#xFF0C;&#x6216;&#x8005;&#x5C06;<code>4-</code>&#x7ED3;&#x70B9;&#x53D8;&#x4E3A;<code>3-</code>&#x7ED3;&#x70B9;&#x3002;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x518D;&#x56DE;&#x5934;&#x5411;&#x4E0A;&#x5206;&#x89E3;&#x6240;&#x6709;&#x4E34;&#x65F6;&#x7684;<code>4-</code>&#x7ED3;&#x70B9;&#x3002;</p>
<h4 id="&#x7EA2;&#x9ED1;&#x6811;&#x7684;&#x5220;&#x9664;&#x64CD;&#x4F5C;">&#x7EA2;&#x9ED1;&#x6811;&#x7684;&#x5220;&#x9664;&#x64CD;&#x4F5C;</h4>
<p>&#x5728;&#x67E5;&#x627E;&#x76EE;&#x6807;&#x503C;&#x7684;&#x8DEF;&#x5F84;&#x4E0A;&#x8FDB;&#x884C;&#x548C;&#x5220;&#x9664;&#x6700;&#x5C0F;&#x952E;&#x76F8;&#x540C;&#x7684;&#x53D8;&#x6362;&#xFF0C;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x5728;&#x67E5;&#x627E;&#x8FC7;&#x7A0B;&#x4E2D;&#x4EFB;&#x610F;&#x5F53;&#x524D;&#x7ED3;&#x70B9;&#x5747;&#x4E0D;&#x662F;<code>2-</code>&#x7ED3;&#x70B9;&#x3002;</p>
<ul>
<li>&#x82E5;&#x8981;&#x5220;&#x9664;&#x7684;&#x952E;&#x5728;&#x6811;&#x7684;&#x5E95;&#x90E8;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5220;&#x9664;&#x5B83;</li>
<li>&#x82E5;&#x4E0D;&#x5728;&#x5E95;&#x90E8;&#xFF0C;&#x56E0;&#x4E3A;&#x5F53;&#x524D;&#x7ED3;&#x70B9;&#x5FC5;&#x7136;&#x4E0D;&#x662F;2-&#x7ED3;&#x70B9;&#xFF0C;&#x95EE;&#x9898;&#x5DF2;&#x7ECF;&#x8F6C;&#x5316;&#x4E3A;&#x5728;&#x4E00;&#x4E2A;&#x4E0D;&#x662F;<code>2-</code>&#x7ED3;&#x70B9;&#x4E2D;&#x5220;&#x9664;&#x952E;&#xFF0C;&#x5220;&#x9664;&#x4E4B;&#x540E;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5411;&#x4E0A;&#x56DE;&#x6EAF;&#x5E76;&#x5206;&#x89E3;&#x4F59;&#x4E0B;&#x7684;<code>4-</code>&#x7ED3;&#x70B9;&#x3002;</li>
</ul>
<h3 id="&#x7EA2;&#x9ED1;&#x6811;&#x7684;&#x6027;&#x8D28;">&#x7EA2;&#x9ED1;&#x6811;&#x7684;&#x6027;&#x8D28;</h3>
<p>&#x4E00;&#x68F5;&#x5927;&#x5C0F;&#x4E3A;N&#x7684;&#x7EA2;&#x9ED1;&#x6811;&#xFF1A;</p>
<ul>
<li>&#x7684;&#x9AD8;&#x5EA6;&#x4E0D;&#x4F1A;&#x8D85;&#x8FC7;<code>2lgN</code></li>
<li>&#x6839;&#x7ED3;&#x70B9;&#x5230;&#x4EFB;&#x610F;&#x7ED3;&#x70B9;&#x7684;&#x5E73;&#x5747;&#x8DEF;&#x5F84;&#x957F;&#x5EA6;&#x4E3A;~lgN</li>
<li>&#x5728;&#x6700;&#x574F;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x63D2;&#x5165;&#x3001;&#x67E5;&#x627E;&#x3001;&#x5220;&#x9664;&#x64CD;&#x4F5C;&#x6240;&#x9700;&#x7684;&#x65F6;&#x95F4;&#x90FD;&#x662F;&#x5BF9;&#x6570;&#x7EA7;&#x7684;</li>
</ul>
<p>&#x5404;&#x79CD;&#x7B26;&#x53F7;&#x8868;&#x7684;&#x5B9E;&#x73B0;&#x6027;&#x80FD;
|&#x7B97;&#x6CD5;(&#x6570;&#x636E;&#x7ED3;&#x6784;)|&#x6700;&#x574F;&#x63D2;&#x5165;|&#x5E73;&#x5747;&#x63D2;&#x5165;|&#x6700;&#x574F;&#x67E5;&#x627E;|&#x5E73;&#x5747;&#x67E5;&#x627E;|&#x662F;&#x5426;&#x652F;&#x6301;&#x6709;&#x5E8F;&#x6027;|
|:-:|:-:|:-:|:-:|:-:|:-:|
|&#x987A;&#x5E8F;&#x67FB;&#x8BE2;(&#x65E0;&#x5E8F;&#x94FE;&#x8868;)|N|N/2|N|N|&#x5426;|
|&#x4E8C;&#x5206;&#x67E5;&#x627E;(&#x6709;&#x5E8F;&#x6570;&#x7EC4;)|lgN|lgN|N|N/2|&#x662F;|
|&#x4E8C;&#x53C9;&#x6811;&#x67E5;&#x627E;(BST)|N|1.39lgN|N|1.39lgN|&#x662F;|
|2-3&#x6811;&#x67E5;&#x627E;(&#x7EA2;&#x9ED1;&#x6811;)|2lgN|lgN|2lgN|lgN|&#x662F;|</p>
<p>&#x7EA2;&#x9ED1;&#x6811;&#x6574;&#x4F53;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#x53C2;&#x8003;<a href="RedBlackBST.java">RedBlackBST</a>&#x548C;<a href="RedBlackLiteBST.java">RedBlackLiteBST</a>&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="3.2-binarysearchtrees.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 3.2-二分查找树BinarySearchTrees">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"3.3-平衡二叉查找树BalancedSearchTrees","level":"1.3.3","depth":2,"previous":{"title":"3.2-二分查找树BinarySearchTrees","level":"1.3.2","depth":2,"path":"3-searching/3.2-binarysearchtrees.md","ref":"3-searching/3.2-binarysearchtrees.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"3-searching/3.3-balancedsearchtrees.md","mtime":"2020-11-10T10:15:10.818Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-11-10T10:15:51.444Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

